---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilder.OwnerInfo
source: html/5c2c3e95-ae6e-f303-a770-662acf186181.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.OwnerInfo Property

String used for logging, if any. Usually describes the element or object, which
 either defined or will own the geoemtrical objects to be built.

## Syntax (C#)
```csharp
public string OwnerInfo { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null